{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ACTION",
    "2": "I-ACTION",
    "3": "B-CERTIFICATION",
    "4": "I-CERTIFICATION",
    "5": "B-COLLABORATION",
    "6": "I-COLLABORATION",
    "7": "B-COMPANY",
    "8": "I-COMPANY",
    "9": "B-DESIGNATION",
    "10": "I-DESIGNATION",
    "11": "B-EDUCATION",
    "12": "I-EDUCATION",
    "13": "B-EMAIL",
    "14": "I-EMAIL",
    "15": "B-EXPERIENCE",
    "16": "I-EXPERIENCE",
    "17": "B-EXPERTISE",
    "18": "I-EXPERTISE",
    "19": "B-LANGUAGE",
    "20": "I-LANGUAGE",
    "21": "B-LOCATION",
    "22": "I-LOCATION",
    "23": "B-PERSON",
    "24": "I-PERSON",
    "25": "B-SKILL",
    "26": "I-SKILL"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-ACTION": 1,
    "B-CERTIFICATION": 3,
    "B-COLLABORATION": 5,
    "B-COMPANY": 7,
    "B-DESIGNATION": 9,
    "B-EDUCATION": 11,
    "B-EMAIL": 13,
    "B-EXPERIENCE": 15,
    "B-EXPERTISE": 17,
    "B-LANGUAGE": 19,
    "B-LOCATION": 21,
    "B-PERSON": 23,
    "B-SKILL": 25,
    "I-ACTION": 2,
    "I-CERTIFICATION": 4,
    "I-COLLABORATION": 6,
    "I-COMPANY": 8,
    "I-DESIGNATION": 10,
    "I-EDUCATION": 12,
    "I-EMAIL": 14,
    "I-EXPERIENCE": 16,
    "I-EXPERTISE": 18,
    "I-LANGUAGE": 20,
    "I-LOCATION": 22,
    "I-PERSON": 24,
    "I-SKILL": 26,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
